; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	spectrograph0 - mode
	thermograph5 - mode
	image2 - mode
	infrared4 - mode
	spectrograph1 - mode
	infrared3 - mode
	GroundStation0 - direction
	GroundStation5 - direction
	GroundStation3 - direction
	GroundStation1 - direction
	Star4 - direction
	Star2 - direction
	Planet6 - direction
	Star7 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Star10 - direction
	Planet11 - direction
	Star12 - direction
	Phenomenon13 - direction
)
(:init
	(supports instrument0 thermograph5)
	(supports instrument0 spectrograph1)
	(calibration_target instrument0 GroundStation3)
	(calibration_target instrument0 GroundStation5)
	(supports instrument1 infrared3)
	(supports instrument1 thermograph5)
	(supports instrument1 infrared4)
	(calibration_target instrument1 GroundStation1)
	(calibration_target instrument1 GroundStation0)
	(supports instrument2 infrared4)
	(calibration_target instrument2 Star4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation5)
	(supports instrument3 infrared4)
	(calibration_target instrument3 GroundStation5)
	(calibration_target instrument3 GroundStation1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star4)
	(supports instrument4 infrared4)
	(supports instrument4 image2)
	(supports instrument4 spectrograph0)
	(calibration_target instrument4 GroundStation3)
	(calibration_target instrument4 GroundStation1)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet8)
	(supports instrument5 infrared4)
	(supports instrument5 spectrograph0)
	(calibration_target instrument5 Star2)
	(supports instrument6 spectrograph1)
	(calibration_target instrument6 GroundStation1)
	(supports instrument7 spectrograph1)
	(supports instrument7 infrared3)
	(calibration_target instrument7 Star2)
	(calibration_target instrument7 Star4)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star2)
)
(:goal (and
	(pointing satellite1 Planet8)
	(pointing satellite2 Phenomenon9)
	(pointing satellite3 GroundStation3)
	(have_image Planet6 thermograph5)
	(have_image Planet6 infrared3)
	(have_image Star7 image2)
	(have_image Planet8 thermograph5)
	(have_image Planet8 infrared3)
	(have_image Phenomenon9 spectrograph1)
	(have_image Star10 infrared3)
	(have_image Planet11 infrared3)
	(have_image Planet11 image2)
	(have_image Star12 spectrograph0)
	(have_image Star12 image2)
	(have_image Phenomenon13 spectrograph1)
	(have_image Phenomenon13 infrared4)
))

)

; plan
1. (switch_on instrument7 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument7)
   goals met: 0 of 16
2. (calibrate satellite3 instrument7 star2)
   added: (calibrated instrument7)
   goals met: 0 of 16
3. (turn_to satellite3 phenomenon9 star2)
   deleted: (pointing satellite3 star2)
   added: (pointing satellite3 phenomenon9)
   goals met: 0 of 16
4. (take_image satellite3 phenomenon9 instrument7 spectrograph1)
   added: (have_image phenomenon9 spectrograph1)
   goals met: 1 of 16
5. (turn_to satellite3 phenomenon13 phenomenon9)
   deleted: (pointing satellite3 phenomenon9)
   added: (pointing satellite3 phenomenon13)
   goals met: 1 of 16
6. (turn_to satellite2 groundstation1 planet8)
   deleted: (pointing satellite2 planet8)
   added: (pointing satellite2 groundstation1)
   goals met: 1 of 16
7. (turn_to satellite1 planet8 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 planet8)
   goals met: 2 of 16
8. (turn_to satellite0 groundstation0 groundstation5)
   deleted: (pointing satellite0 groundstation5)
   added: (pointing satellite0 groundstation0)
   goals met: 2 of 16
9. (take_image satellite3 phenomenon13 instrument7 spectrograph1)
   added: (have_image phenomenon13 spectrograph1)
   goals met: 3 of 16
10. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 3 of 16
11. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 3 of 16
12. (calibrate satellite2 instrument4 groundstation1)
   added: (calibrated instrument4)
   goals met: 3 of 16
13. (calibrate satellite0 instrument1 groundstation0)
   added: (calibrated instrument1)
   goals met: 3 of 16
14. (turn_to satellite0 phenomenon13 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 phenomenon13)
   goals met: 3 of 16
15. (take_image satellite0 phenomenon13 instrument1 infrared4)
   added: (have_image phenomenon13 infrared4)
   goals met: 4 of 16
16. (turn_to satellite0 planet11 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 planet11)
   goals met: 4 of 16
17. (take_image satellite0 planet11 instrument1 infrared3)
   added: (have_image planet11 infrared3)
   goals met: 5 of 16
18. (turn_to satellite0 planet6 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 planet6)
   goals met: 5 of 16
19. (take_image satellite0 planet6 instrument1 infrared3)
   added: (have_image planet6 infrared3)
   goals met: 6 of 16
20. (take_image satellite0 planet6 instrument1 thermograph5)
   added: (have_image planet6 thermograph5)
   goals met: 7 of 16
21. (turn_to satellite0 planet8 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 planet8)
   goals met: 7 of 16
22. (take_image satellite0 planet8 instrument1 infrared3)
   added: (have_image planet8 infrared3)
   goals met: 8 of 16
23. (take_image satellite0 planet8 instrument1 thermograph5)
   added: (have_image planet8 thermograph5)
   goals met: 9 of 16
24. (turn_to satellite0 star10 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star10)
   goals met: 9 of 16
25. (take_image satellite0 star10 instrument1 infrared3)
   added: (have_image star10 infrared3)
   goals met: 10 of 16
26. (turn_to satellite2 planet11 groundstation1)
   deleted: (pointing satellite2 groundstation1)
   added: (pointing satellite2 planet11)
   goals met: 10 of 16
27. (take_image satellite2 planet11 instrument4 image2)
   added: (have_image planet11 image2)
   goals met: 11 of 16
28. (turn_to satellite2 star12 planet11)
   deleted: (pointing satellite2 planet11)
   added: (pointing satellite2 star12)
   goals met: 11 of 16
29. (take_image satellite2 star12 instrument4 image2)
   added: (have_image star12 image2)
   goals met: 12 of 16
30. (take_image satellite2 star12 instrument4 spectrograph0)
   added: (have_image star12 spectrograph0)
   goals met: 13 of 16
31. (turn_to satellite2 star7 star12)
   deleted: (pointing satellite2 star12)
   added: (pointing satellite2 star7)
   goals met: 13 of 16
32. (take_image satellite2 star7 instrument4 image2)
   added: (have_image star7 image2)
   goals met: 14 of 16
33. (turn_to satellite2 phenomenon9 star7)
   deleted: (pointing satellite2 star7)
   added: (pointing satellite2 phenomenon9)
   goals met: 15 of 16
34. (turn_to satellite3 groundstation3 phenomenon13)
   deleted: (pointing satellite3 phenomenon13)
   added: (pointing satellite3 groundstation3)
   goals met: 16 of 16
